ka2_2024/src/InformationRegisters/АрендованныеОС/АрендованныеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АрендованныеОС</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОС</types>
    </type>
  </resources>
  <resources>
    <name>НоминальнаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ka2_2024/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПринятоКЗабалансовомуУчету</name>
  </enumValues>
  <enumValues>
    <name>ПереданоВАренду</name>
  </enumValues>
  <enumValues>
    <name>ЗаключенДоговорАренды</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НеПринятоКУчету</name>
  </enumValues>
</mdclass:Enum>

ka2_2024/src/Catalogs/ДоговорыАренды/ДоговорыАренды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыАренды</name>
  <basedOn>Catalog.Партнеры</basedOn>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоровАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерДоговора</name>
    <type>
      <types>EnumRef.ХарактерыДоговоровФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Балансодержатель</name>
    <type>
      <types>EnumRef.БалансодержательПредметовАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредметыАрендыВРеглУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьПредметыАрендыВУпрУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОбеспечительныйПлатеж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВыкупПредметовАренды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьАвансированиеВыкупнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияСтоимостиАктивов</name>
    <type>
      <types>EnumRef.СпособыОпределенияСтоимостиПредметовАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовУслуги</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовУслуги</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеУслуги</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовПроценты</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходовПроценты</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПроценты</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяОформлениеЗаявленийОВвозе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАгентскогоДоговора</name>
    <type>
      <types>EnumRef.ВидыАгентскихДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетАвансовПоТекущимАренднымПлатежамВРазрезеПлатежныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйНомерВалютногоКонтроля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ka2_2024/src/CommonModules/УчетАрендованныхОССлужебный/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Содержит служебные процедуры и функции подсистемы "Аренда".
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Проверяет, что на основании договора аренды можно заполнить документ.
// 
// Параметры:
// 	Договор - СправочникСсылка.ДоговорыАренды -
// 	
// Возвращаемое значение:
// 		- Структура - содержит реквизиты договора:
//			* Организация - СправочникСсылка.Организации -
//			* Партнер - СправочникСсылка.Партнеры - 
//			* Контрагент - СправочникСсылка.Контрагенты -
//			* ВалютаВзаиморасчетов - СправочникСсылка.Валюты -
//			* НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС -
//			* ЕстьВыкупПредметовАренды - Булево - 
//		- Неопределено
//
Функция ПроверитьРеквизитыДоговораАренды(Договор) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДоговорыАренды.Организация,
	|	ДоговорыАренды.Партнер,
	|	ДоговорыАренды.Контрагент,
	|	ДоговорыАренды.ВалютаВзаиморасчетов,
	|	ДоговорыАренды.ЕстьВыкупПредметовАренды,
	|	ДоговорыАренды.ПометкаУдаления,
	|	ДоговорыАренды.НалогообложениеНДС,
	|	ЕСТЬNULL(УсловияДоговоровАренды.Состояние, НЕОПРЕДЕЛЕНО) КАК Состояние
	|ИЗ
	|	Справочник.ДоговорыАренды КАК ДоговорыАренды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровАренды.СрезПоследних(&Дата, Договор = &Договор) КАК УсловияДоговоровАренды
	|		ПО УсловияДоговоровАренды.Договор = &Договор
	|ГДЕ
	|	ДоговорыАренды.Ссылка = &Договор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.ПометкаУдаления Тогда
		ТекстОшибки = НСтр("ru = 'Договор помечен на удаление, создание документа недоступно'");
		ВызватьИсключение ТекстОшибки
	ИначеЕсли Выборка.Состояние <> Перечисления.СостоянияДоговоровКонтрагентов.Действует Тогда
		ТекстОшибки = НСтр("ru = 'Не оформлено заключение договора или договор не действует, создание документа недоступно'");
		ВызватьИсключение ТекстОшибки
	КонецЕсли;
	
	РеквизитыДоговора = Новый Структура;
	РеквизитыДоговора.Вставить("Организация", Выборка.Организация);
	РеквизитыДоговора.Вставить("Партнер", Выборка.Партнер);
	РеквизитыДоговора.Вставить("Контрагент", Выборка.Контрагент);
	РеквизитыДоговора.Вставить("ВалютаВзаиморасчетов", Выборка.ВалютаВзаиморасчетов);
	РеквизитыДоговора.Вставить("ЕстьВыкупПредметовАренды", Выборка.ЕстьВыкупПредметовАренды);
	РеквизитыДоговора.Вставить("НалогообложениеНДС", Выборка.НалогообложениеНДС);
	
	Возврат РеквизитыДоговора;
	
КонецФункции

// Проверяет, что ОС получены в аренду (забалансовый учет).
// 
// Параметры:
// 	Объект - ДокументОбъект.ПоступлениеАрендованныхОС - 
// 	Отказ - Булево -
Процедура ПроверитьЧтоОСНеПолученыВАрендуЗаБалансом(Объект, Отказ) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(АрендованныеОС.Регистратор) КАК ПредставлениеДокумента,
	|	АрендованныеОС.ОсновноеСредство КАК СсылкаНаОС,
	|	АрендованныеОС.ОсновноеСредство.Представление КАК ПредставлениеОС
	|ИЗ
	|	РегистрСведений.АрендованныеОС.СрезПоследних(
	|			&Период,
	|			Регистратор <> &Ссылка
	|				И ОсновноеСредство В (&СписокОС)) КАК АрендованныеОС
	|ГДЕ
	|	АрендованныеОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКЗабалансовомуУчету)";
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("СписокОС", Объект.ОС.ВыгрузитьКолонку("ОсновноеСредство"));
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = НСтр("ru = 'Основное средство ""%1"" уже поступало в аренду (забалансовый учет). См. %2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.ПредставлениеОС, Выборка.ПредставлениеДокумента);
			
		ДанныеСтроки = Объект.ОС.Найти(Выборка.СсылкаНаОС, "ОсновноеСредство");
		Путь = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ОС", ДанныеСтроки.НомерСтроки, "ОсновноеСредство");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Объект, Путь,, Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
